INSERT INTO assets (type, agency_id, district_id, section, status) VALUES
-- A1 (六甲國小, 六甲區)
('土地', 120, 9, '大丘園段', '未活化'),
-- A2 (歡雅國小, 鹽水區)
('土地', 121, 2, '田寮段', '未活化'),
-- A3 (大內國小, 大內區)
('土地', 122, 11, '嗚頭段', '未活化'),
-- A4 (教育局, 大內區)
('土地', 2, 11, '二重溪段', '未活化'),
-- A5 (財政稅務局, 六甲區)
('土地', 18, 9, '六甲段', '未活化'),
-- A6 (財政稅務局, 新營區)
('土地', 18, 1, '長勝段', '未活化'),
-- A7 (財政稅務局, 鹽水區)
('土地', 18, 2, '新岸段', '未活化'),
-- A8 (財政稅務局, 白河區)
('土地', 18, 3, '新興段', '未活化'),
-- A9 (財政稅務局, 白河區)
('土地', 18, 3, '國泰段', '未活化'),
-- A10 (財政稅務局, 白河區)
('土地', 18, 3, '國泰段', '未活化'),
-- A11 (財政稅務局, 新化區)
('土地', 18, 18, '新安段', '未活化'),
-- A12 (財政稅務局, 仁德區)
('土地', 18, 27, '林仔段', '未活化'),
-- A13 (財政稅務局, 佳里區)
('土地', 18, 12, '北文段', '未活化'),
-- A14 (財政稅務局, 將軍區)
('土地', 18, 16, '國中段', '未活化'),
-- A15 (白河國小, 白河區)
('土地', 123, 3, '新興段', '未活化'),
-- A16 (動物防疫保護處, 安南區)
('土地', 25, 36, '淵南段', '未活化'),
-- A17 (經濟發展局, 歸仁區)
('土地', 4, 28, '武東段', '未活化'),
-- A18 (經濟發展局, 歸仁區)
('土地', 4, 28, '武東段', '未活化'),
-- A19 (財政稅務局, 新化區)
('土地', 18, 18, '新東段', '未活化'),
-- A20 (市場處, 學甲區)
('土地', 27, 13, '集和段', '未活化'),
-- A21 (市場處, 新營區)
('土地', 27, 1, '新東段', '未活化');


-- 基於上述已經塞入的資料(asset_id), 進行資料的更新
INSERT INTO land_details
(asset_id, lot_number, land_type, area, zone_type, land_use, current_status, vacancy_rate, note)
VALUES
    -- A1 (六甲國小大丘分班)
    (1, '80-8', '市有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '81-1', '市有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '86-1', '市有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '87', '市有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '80-3', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '88', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '88-1', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '90', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '226', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),
    (1, '226-1', '國有土地', 7826, '學校用地、保護區', NULL, '空置', 100, '六甲國小大丘分班(已裁併校)'),

    -- A2 (歡雅國小大豐分校)
    (2, '313-2', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),
    (2, '314-2', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),
    (2, '315-1', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),
    (2, '1904', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),
    (2, '1905', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),
    (2, '1906', '市有土地', 12877, '鄉村區', '特定目的事業用地', '空置', 100, '歡雅國小大豐分校(已裁併校)'),

    -- A3 (大內國小嗚頭分校)
    (3, '292', '市有土地', 4838, '山坡地保育區', '特定目的事業用地', '空置', 100, '大內國小嗚頭分校(已裁併校)'),
    (3, '293-1', '市有土地', 4838, '鄉村區', '乙種建築用地', '空置', 100, '大內國小嗚頭分校(已裁併校)'),
    (3, '294-7', '市有土地', 4838, '鄉村區', '特定目的事業用地', '空置', 100, '大內國小嗚頭分校(已裁併校)'),

    -- A4 (二溪國小吉林分班)
    (4, '82', '市有土地', 1518.2, '山坡地保育區', '特定目的事業用地', '空置', 100, '二溪國小吉林分班(已裁併校)'),
    (4, '82-1', '市私共有土地', 1518.2, '山坡地保育區', '農牧用地', '空置', 100, '二溪國小吉林分班(已裁併校)'),

    -- A5
    (5, '4-10', '市有土地', 27837, '山坡地保育區', '特定目的事業用地', '空置', 100, NULL),

    -- A6
    (6, '69', '市有土地', 1538.19, '行政文教區', NULL, '空置', 100, NULL),

    -- A7
    (7, '82', '市有土地', 640.45, '住宅區', NULL, '空置', 100, NULL),
    (7, '83', '市有土地', 640.45, '住宅區', NULL, '空置', 100, NULL),

    -- A8
    (8, '984', '市有土地', 892, '住宅區', NULL, '空置', 100, NULL),

    -- A9
    (9, '3', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-1', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-2', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-3', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-4', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-5', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-6', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-7', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),
    (9, '3-8', '市有土地', 1597.53, '住宅區', NULL, '空置', 100, NULL),

    -- A10
    (10, '4', '市有土地', 880.8, '住宅區', NULL, '空置', 100, NULL),

    -- A11
    (11, '415', '市有土地', 267.15, '住宅區', NULL, '空置', 100, NULL),

    -- A12
    (12, '961', '市有土地', 5810.56, '工業區', NULL, '空置', 100, NULL),
    (12, '961-1', '市有土地', 5810.56, '工業區', NULL, '空置', 100, NULL),

    -- A13
    (13, '297', '市有土地', 427.35, '住宅區', NULL, '空置', 100, NULL),

    -- A14
    (14, '640', '市有土地', 400.68, '住宅區', NULL, '空置', 100, NULL),

    -- A15
    (15, '1', '市有土地', 1000, '住宅區', NULL, '空置', 100, NULL),

    -- A16
    (16, '747', '市有土地', 6277.4, '農業區', NULL, '空置', 100, '該土地無對外道路'),

    -- A17
    (17, '75', '市有土地', 1546.54, '加油站專用區', NULL, '空置', 100, NULL),

    -- A18
    (18, '523', '市有土地', 9279.2, '自來水專用區', NULL, '空置', 100, NULL),

    -- A19
    (19, '914', '市有土地', 111.85, '住宅區', NULL, '空置', 100, NULL),

    -- A20
    (20, '1170', '市有土地', 1658.73, '零售市場用地', NULL, '空置', 100, '雜木、綠地'),

    -- A21
    (21, '446', '市有土地', 2293.52, '零售市場用地', NULL, '空置', 100, '雜木、綠地');


-- -- 後來加上 created_at, updated_at, deleted_at
-- -- 1. 新增欄位
-- ALTER TABLE land_details
-- ADD COLUMN created_at TIMESTAMP,
-- ADD COLUMN updated_at TIMESTAMP,
-- ADD COLUMN deleted_at TIMESTAMP;

-- -- 2. 設定預設值
-- UPDATE land_details
-- SET created_at = NOW(),
--     updated_at = NOW();

-- -- 3. 設定 NOT NULL 約束和預設值
-- ALTER TABLE land_details
-- ALTER COLUMN created_at SET NOT NULL,
-- ALTER COLUMN created_at SET DEFAULT NOW(),
-- ALTER COLUMN updated_at SET NOT NULL,
-- ALTER COLUMN updated_at SET DEFAULT NOW();
